{
    "timeline":
    {
        "headline": "A brief history of Sri Lanka",
        "type": "default",
            "text": "Independence, conflicts and pivotal moments in the country once known as Ceylon",
            "startDate": "1945",
            "date": [
                {
                    "startDate" : "1948,2,4",
                    "endDate" : null,
                    "text" : "Ceylon (as Sri Lanka was then called) attains independence from Britain. ",
                    "asset" : {
                        "media" : "./images/timeline/102247923.jpg",
                        "credit" : "AFP/Getty Images",
                        "caption" : "The ceremonial opening 10 February 1948 of Sri Lanka's first parliament six days after independence from Britain."
                    },
                    "headline" : "Ceylon attains independence"
                },
                {
                    "startDate" : "1956,12,4",
                    "endDate" : null,
                    "text" : "Solomon Bandaranaike’s populist Sri Lanka Freedom Party wins government after campaigning on a majoritarian Sinhalese Buddhist ticket.  ",
                    "asset" : {
                        "media" : "./images/timeline/GettyImages_82139288.jpg",
                        "credit" : "Paul Popper/Popperfoto/Getty Images",
                        "caption" : "Solomon Bandaranaike c. 1956"
                    },
                    "headline" : "Sri Lanka Freedom Party wins government"
                },
                {
                    "startDate" : "1956",
                    "endDate" : "1958",
                    "text" : "The ‘Sinhala Only’ Act is passed. It denies official recognition to the Tamil language, spoken at the time by around 25 per cent of the island’s population.",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "The cotroversial 'Sinhala Only' Act is passed"
                },
                {
                    "startDate" : "1958,5,24",
                    "endDate" : "1958,5,27",
                    "text" : "Race riots between Sinhalese and Tamils leave 300 people dead.",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "Race riots leave hundreds dead"
                },
                {
                    "startDate" : "1970",
                    "endDate" : null,
                    "text" : "The importation of Tamil-language literature is banned by the government.",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "Tamil-language literature is banned by the government"
                },
                {
                    "startDate" : "1971",
                    "endDate" : "1977,8,4",
                    "text" : " An official ‘Standardisation’ education quota policy is introduced, which limits Tamil access to universities. A Marxist rebellion begins among the southern Sinhalese community.",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "Standardisation' education quota policy is introduced."
                },
                {
                    "startDate" : "1972,5,22",
                    "endDate" : null,
                    "text" : "Ceylon becomes a republic and is renamed Sri Lanka ",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "Ceylon is renamed Sri Lanka"
                },
                {
                    "startDate" : "1975,7,27",
                    "endDate" : null,
                    "text" : "The pro-Colombo mayor of the northern city of Jaffna, Alfred Duraiappah, is assassinated by Tamil militia member Vellupillai Prabhakaran.",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "Major of Jaffna, Alfred Duraiappah, is assassinated"
                },
                {
                    "startDate" : "1976,5,5",
                    "endDate" : null,
                    "text" : "The separatist militia, Liberation Tigers of Tamil Eelam, or Tamil Tigers, is formed, and demands a separate state in the mostly Tamil north-east. It calls this zone Eelam, evoking the ancient Tamil name for the island. Prabhakaran is the LTTE’s military commander.",
                    "asset" : {
                        "media" : "./images/timeline/2765082.jpg",
                        "credit" : "STR/AFP/Getty Images",
                        "caption" : "KILINOCHCHI, SRI LANKA: Liberation Tigers of Tamil Eelam (LTTE) supremo Velupillai Prabhakaran stands next to the LTTE flag during his annual Heroes' Week address to his people from the Northern Sri Lankan town of Kilinochchi, 27 November 2003."
                    },
                    "headline" : "The Liberation Tigers of Tamil Eelam (LTTE), a seperatist militia, is formed"
                },
                {
                    "startDate" : "1981,5,31",
                    "endDate" : "1981,6,1",
                    "text" : "The historic Jaffna library is razed in a fire set by a Sinhalese mob after Sinhalese police were killed at a pro-Tamil rally.",
                    "asset" : {
                        "media" : "./images/timeline/2728691.jpg",
                        "credit" : "Luis Ascui/Getty Images",
                        "caption" : "A security guard patrols outside the Jaffna in 2003, before it was re-opened to the public the next year."
                    },
                    "headline" : "Jaffna library is burnt down"
                },
                {
                    "startDate" : "1983,7,23",
                    "endDate" : "2009,5,18",
                    "text" : "LTTE rebels kill 13 government soldiers in an ambush. The island-wide ‘Black July’ anti-Tamil attacks follow – a pogrom that leaves some 3,000 people dead and forces hundreds of thousands of Tamils to flee abroad. The Sri Lankan civil war begins.",
                    "asset" : {
                        "media" : "./images/timeline/51993110.jpg",
                        "credit" : "MILITARY PHOTO/AFP/Getty Images",
                        "caption" : "Sri Lankan soldiers check the remains of an improvised aircraft captured from Tamil Tiger guerrillas in October 1995, at the town of Neerveli in the northern Jaffna peninsula."
                    },
                    "headline" : "LTTE Rebels kill 13 government soldiers sparking a civil war"
                },
                {
                    "startDate" : "1987,7,29",
                    "endDate" : "1990,3,24",
                    "text" : "Indian SIGNS THE indo-Sri Lanka Peace Accord with Sri-Lanka, after which Indian troops begin ‘peace-keeping’ operations in the north-east, which quickly descend into a war against the LTTE that rages until 1990 when India withdraws. ",
                    "asset" : {
                        "media" : "./images/timeline/52017509.jpg",
                        "credit" : "DOUGLAS E. CURRAN/AFP/Getty Images",
                        "caption" : "ELEPHANT PASS, SRI LANKA - OCTOBER 15: A convoy of Indian troops moves towards Jaffna town 15 October 1987 from Elephant Pass, 25 miles (40 km) south of the rebel bastion under siege by Indian peace keeping forces."
                    },
                    "headline" : "Indian troops begin 'peacekeeping' in the north-east, fueling another war against the LTTE. "
                },
                {
                    "startDate" : "1987,11,14",
                    "endDate" : null,
                    "text" : "The 13th Amendment to the Sri Lankan constitution enshrines Tamil as an official language. The Marxist-Leninist People’s Liberation Front begins another insurrection in the Sinhalese south, starting a civil war within a civil war.",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "The 13th Amendment to the Sri Lankan constitution makes Tamil an official language"
                },
                {
                    "startDate" : "1991,5,21",
                    "endDate" : "1991,5,21",
                    "text" : "Indian Prime Minister Rajiv Gandhi is assassinated by an LTTE suicide bomber in Madras/Chennai, in revenge for India’s incursion into the Sri Lankan conflict.",
                    "asset" : {
                        "media" : "./images/timeline/52013752.jpg",
                        "credit" : "DOUGLAS E. CURRAN/AFP/Getty Images",
                        "caption" : "NEW DELHI, INDIA - MAY 24: photo dated 24 May 1991 of funeral procession for assassinated former Indian Prime Minister Rajiv Gandhi departing from Teen Murti Bhavan in the Indian capital."
                    },
                    "headline" : "Indian PM is assassinated by an LTTE sucide bomber"
                },
                {
                    "startDate" : "1993,5,1",
                    "endDate" : "1993,5,1",
                    "text" : "Sri Lankan President Ranasinghe Premadasa is assassinated by an LTTE suicide bomber in Colombo.",
                    "asset" : {
                        "media" : "./images/timeline/52030486.jpg",
                        "credit" : "DOUGLAS E. CURRAN/AFP/Getty Images",
                        "caption" : "A soldier watches the funeral procession of Sri Lankan President Ranasinghe Premadasa  in Colombo, May 6, 1993."
                    },
                    "headline" : "Sri Lankan President is assassinated by an LTTE sucide bomber"
                },
                {
                    "startDate" : "1995,12,5",
                    "endDate" : null,
                    "text" : "The Tamil ‘capital’ Jaffna falls to government forces. The LTTE retreats south to secure the Vanni region, eventually setting up its Eelam ‘capital’ in the town of Kilinochchi.",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "Tamil capital falls to government forces"
                },
                {
                    "startDate" : "2001,9,11",
                    "endDate" : null,
                    "text" : " Al-Qaeda’s attacks in the US trigger America’s War on Terror. The Eelam Tigers, who crave international recognition, start making peace overtures. ",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "LTTE start making peace overtures"
                },
                {
                    "startDate" : "2001,11,10",
                    "endDate" : null,
                    "text" : "John Howard’s Liberal Government wins the Australian federal election in which it promises a “Pacific Solution” to stop asylum seekers coming to Australia by boat from neighbouring countries, including Sri Lanka.",
                    "asset" : {
                        "media" : "./images/timeline/680903.jpg",
                        "credit" : "Nick Laham/Getty Images",
                        "caption" : "John Howard celebrates victory with his family, after his election win, November 10, 2001"
                    },
                    "headline" : "John Howard's Pacific Solution promises to stop asylum seekers coming by boat, including Sri Lanka."
                },
                {
                    "startDate" : "2001",
                    "endDate" : "2002",
                    "text" : "As part of a Norwegian-sponsored peace process, a ceasefire is negotiated between Colombo and the LTTE. The Tigers drop demands for a separate Tamil state and the two sides pursue federalist discussions.",
                    "asset" : {
                        "media" : "./images/timeline/51405599.jpg",
                        "credit" : "STR/AFP/Getty Images",
                        "caption" : "Tamil Tiger leader Velupillai Prabhakaran signs a historic ceasefire agreement in 2002, to clear the way for Norwegian-brokered peace talks with the Colombo government."
                    },
                    "headline" : "Ceasefire negotiated"
                },
                {
                    "startDate" : "2004,3",
                    "endDate" : null,
                    "text" : "The LTTE’s eastern commander Colonel Karuna breaks with the LTTE, splitting the weakened movement in two. ",
                    "asset" : {
                        "media" : "./images/timeline/52065976.jpg",
                        "credit" : "PRAKASH SINGH/AFP/Getty Images",
                        "caption" : "GALLE, SRI LANKA: Sri Lankans stand amongst earthenware lamps which spell 'Tsunami 2004' in sinhalese at Unawatuna Beach in Galle, some 123 km south of Colombo, 26 January 2005."
                    },
                    "headline" : "Prominent Colonel Karuana breaks with the LTTE"
                },
                {
                    "startDate" : "2004,12,26",
                    "endDate" : null,
                    "text" : "The Boxing Day tsunami devastates the island, killing 35,000 people. Disputes simmer between the Tigers and the government over international aid.",
                    "asset" : {
                        "media" : "./images/timeline/51896083.jpg",
                        "credit" : "JIMIN LAI/AFP/Getty Images",
                        "caption" : "A house stands amid debris from tsunamis in the Galle district of Sri Lanka, December 27, 2004."
                    },
                    "headline" : "Boxing Day Tsumani kills 35, 000 people"
                },
                {
                    "startDate" : "2004",
                    "endDate" : "2005,6",
                    "text" : "The devastating tsunami gives Colombo access to aid-starved Eelam. (In June 2005 the Sri Lankan high court blocked an agreement in June to allow sharing of tsunami aid with the LTTE)",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "Colombo given access to aid-starved Eelam"
                },
                {
                    "startDate" : "2005",
                    "endDate" : null,
                    "text" : "Scandinavian peace monitors report thousands of treaty violations by both sides. Mahinda Rajapaksa campaigns for the presidency on a tough anti-LTTE ticket. The Tigers boycott the poll, effectively handing power to Rajapaksa.",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "Mahinda Rajapaksa wins presidency"
                },
                {
                    "startDate" : "2006,10",
                    "endDate" : null,
                    "text" : "Peace talks resume, then swiftly collapse as the LTTE withdraws. Hostilities resume.",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "Peace talks resume then collapse"
                },
                {
                    "startDate" : "2008,1,16",
                    "endDate" : null,
                    "text" : "The ceasefire is officially terminated by the Rajapaksa government. The civil war resumes, with renewed vigour on the part of the China-backed government which progressively takes critical LTTE strongholds.",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "The civil war resumes"
                },
                {
                    "startDate" : "2009,5,18",
                    "endDate" : null,
                    "text" : "Prabharakan and senior Tamil Tigers are killed in battle by government forces, bringing the war to an end. Colombo takes full control of the island for the first time in 26 years.",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "Senior Tigers killed in battle with government forces. War is over"
                },
                {
                    "startDate" : "2009",
                    "endDate" : "2010",
                    "text" : " As many as 500,000 refugees are corralled, screened and ‘de-Tigerised’ in  government-controlled camps in the north.",
                    "asset" : {
                        "media" : "./images/timeline/85012282.jpg",
                        "credit" : "LAKRUWAN WANNIARACHCHI/AFP/Getty Images",
                        "caption" : "Sri Lankan soldiers keep watch as Tamil students study at a camp for war-displaced Tamils in Vavuniya on February 23, 2009."
                    },
                    "headline" : "500, 000 refugees corrallaed in government-controlled camps"
                },
                {
                    "startDate" : "2010,27,1",
                    "endDate" : null,
                    "text" : "2010 - Amidst international allegations of war crimes, Rajapaksa is re-elected President in a landslide victory.",
                    "asset" : {
                        "media" : "./images/timeline/96462340.jpg",
                        "credit" : "LAKRUWAN WANNIARACHCHI/AFP/Getty Images",
                        "caption" : "Sri Lankan President Mahinda Rajapakse (C) addresses the nation as Commanders of the Army (L) and Navy look on during the island's 62th Independence Day celebrations outside the highly venerated Temple of the Tooth in the central town of Kandy on February 4, 2010. "
                    },
                    "headline" : "Rajapaksa re-elected in landslide victory"
                },
                {
                    "startDate" : "2013,1,11",
                    "endDate" : null,
                    "text" : " The Rajapaksa-controlled Parliament impeaches Chief Justice Shirani Bandaranayake on 14 charges of financial and official misconduct, which the opposition claims are politically motivated. She is dismissed and replaced by the government's senior legal adviser, Mohan Peiris. ",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "Chief Justice Shirani Bandaranayake dismissed and replaced"
                },
                {
                    "startDate" : "2013,3,21",
                    "endDate" : null,
                    "text" : "2013 March - The United Nations Human Rights Council passes a highly critical resolution urging Sri Lanka to conduct an \"independent and credible investigation\" into alleged war crimes during the Tamil Tiger insurgency.",
                    "asset" : {
                        "media" : "./images/timeline/163593597.jpg",
                        "credit" : "Ishara S.KODIKARA/AFP/Getty Images",
                        "caption" : "Sri Lankan demonstrators hold portraits of missing relatives during a protest outside the United nations office in Colombo on March 13, 2013."
                    },
                    "headline" : "UN Human Rights Council urges investigation into war crimes"
                },
                {
                    "startDate" : "2013,4",
                    "endDate" : null,
                    "text" : "2013 April - Amnesty International accuses Sri Lanka of intensifying a crackdown on dissent, and urges CHOGM not to hold its next summit there unless the human-rights situation is improved. Sri Lanka rejects the allegations, claiming that a rehabilitation process is underway.",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "Amnesty Internation urges CHOGM not to hold the next summit in Sri Lanka"
                },
                {
                    "startDate" : "2013,9,21",
                    "endDate" : "2013,9,21",
                    "text" : "Provincial Elections: The first post-war provincial elections in the country's mostly Tamil northern province are set for September 21, four years after the end of the civil war. ",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "First post-war provincial elections to be held"
                },
                {
                    "startDate" : "2013,11,15",
                    "endDate" : "2013,11,17",
                    "text" : "The Commonwealth Heads of Government Meeting (CHOGM) will be held in Colombo. Canada has already declared it will not attend the CHOGM summit, citing Sri Lanka’s poor human-rights record. Australia and Britain will attend.",
                    "asset" : {
                        "media" : null,
                        "credit" : null,
                        "caption" : null
                    },
                    "headline" : "CHOGM to be held in Colombo. Australia set to attend"
                }
            ]
    }
}